In [3]:
#Import libraries
import numpy as np
import pandas as pd

pop = pd.read_csv('C:\Sharath\DATA SETS\SAMPLE DATA\Pop.csv')
Abbrev = pd.read_csv('C:\Sharath\DATA SETS\SAMPLE DATA\Abbrev.csv')
Area = pd.read_csv('C:\Sharath\DATA SETS\SAMPLE DATA\Area.csv')

In [6]:
Abbrev.columns

Index(['state', 'abbreviation'], dtype='object')

In [9]:
pop.columns

Index(['state/region', 'ages', 'year', 'population'], dtype='object')

In [14]:
#Merging
merged = pd.merge(pop,Abbrev,how='outer',left_on='state/region',right_on='abbreviation')
merged = merged.drop('abbreviation',axis=1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [18]:
#Checking for null values
merged.isnull().sum()

state/region     0
ages             0
year             0
population      20
state           96
dtype: int64

In [21]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [22]:
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [30]:
merged.loc[merged['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [31]:
merged.loc[merged['state/region'] == 'PR','state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA','state'] = 'United States'

In [33]:
merged.isnull().sum()

state/region     0
ages             0
year             0
population      20
state            0
dtype: int64

In [41]:
final = pd.merge(merged,Area,how='left',on='state')
final

     state/region     ages  year   population          state  area (sq. mi)
0              AL  under18  2012    1117489.0        Alabama        52423.0
1              AL    total  2012    4817528.0        Alabama        52423.0
2              AL  under18  2010    1130966.0        Alabama        52423.0
3              AL    total  2010    4785570.0        Alabama        52423.0
4              AL  under18  2011    1125763.0        Alabama        52423.0
...           ...      ...   ...          ...            ...            ...
2539          USA    total  2010  309326295.0  United States            NaN
2540          USA  under18  2011   73902222.0  United States            NaN
2541          USA    total  2011  311582564.0  United States            NaN
2542          USA  under18  2012   73708179.0  United States            NaN
2543          USA    total  2012  313873685.0  United States            NaN

[2544 rows x 6 columns]

In [43]:
final.isnull().sum()

state/region      0
ages              0
year              0
population       20
state             0
area (sq. mi)    48
dtype: int64

In [46]:
final['state/region'][final['area (sq. mi)'].isnull()].unique()

array(['USA'], dtype=object)

In [47]:
final.dropna(inplace=True)

In [49]:
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [58]:
data2010 = final.query("year==2010 & ages=='total'")
data2010.set_index('state',inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']
density.sort_values(ascending=False,inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64